Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Resume the task awaiting the continuation by having it return normally from its suspension point.
ja: 継続を待っているタスクを、それにそれの中断地点から通常に復帰させることによって再開します。

source: Resume the task awaiting the continuation by having it throw an error from its suspension point.
ja: 継続を待っているタスクを、それにそれの中断地点からエラーをスローさせることによって再開します。

source: Resume the task that’s awaiting the continuation by returning or throwing the given result value.
ja: 与えられた結果値をスローするまたは返すことによって、継続を待っているタスクを再開します。

source: Resume the task that’s awaiting the continuation by returning the given value.
ja: 与えられた値を返すことによって、継続を待っているタスクを再開します。

source: Resume the task that’s awaiting the continuation by returning.
ja: 返すことによって、継続を待っているタスクを再開します。

source: Resume the task that’s awaiting the continuation by throwing the given error.
ja: 与えられたエラーをスローすることによって、継続を待っているタスクを再開します。

source: Resuming from a continuation more than once is undefined behavior.
ja: ある継続から一回以上再開することは、未定義挙動です。

source: Retaining the collection’s storage can be a useful optimization when you’re planning to grow the collection again.
ja: コレクションのストレージを保持することは、あなたがコレクションをもう一度増大しようと計画している時に、ひとつの有益な最適化であることができます。

source: Retaining the storage can be a useful optimization when you’re planning to grow the string again.
ja: ストレージを保持することは、あなたが文字列をもう一度増大しようと計画している時に、ひとつの有益な最適化であることができます。

source: Retrieves and returns the referenced instance, returning the pointer’s memory to an uninitialized state.
ja: 参照されたインスタンスを取ってきて返します、ポインタのメモリを初期化されない状態へ戻します。

source: Return Value
ja: 戻り値

source: Return: The element that was yielded or a error that was thrown.
ja: 戻り：生み出された要素またはスローされたエラー。

source: Return: The element that was yielded.
ja: 戻り：生み出された要素。

source: Returns -1 if this value is negative and 1 if it’s positive; otherwise, 0.
ja: この値が負ならば-1そしてそれが正ならば1；それ以外では0を返します。

source: Returns true if the task is cancelled, and should stop executing.
ja: trueを返します、もしタスクが取り消される、そして遂行を停止すべきならば。

source: Returns true if this value is a multiple of the given value, and false otherwise.
ja: trueをもしこの値がその与えられた値の倍数ならば、そしてfalseをそうでないならば返します。

source: Returns a CVaListPointer that is backed by autoreleased storage, built from the given array of arguments.
ja: オートリリースされるストレージによって裏付けられるCVaListPointerを返します、いくらかの引数からなる与えられた配列から組み立てられます。

source: Returns a LazyMapSequence over this Sequence.
ja: このSequenceを覆うLazyMapSequenceを返します。

source: Returns a Boolean value indicating whether every element of a sequence satisfies a given predicate.
ja: シーケンスのすべての要素がある与えられた述部を満たすかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given object is known to have a single strong reference.
ja: あるブール値を返して、与えられたオブジェクトが１つだけ強い参照を持つことを知られるかどうかを指し示します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are equivalent to the elements in another sequence, using the given predicate as the equivalence test.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同等かどうかを、与えられた述部を同等性テストとして使って指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are the same as the elements in another sequence.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同じかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains an element that satisfies the given predicate.
ja: 指定された述部を満足させるある要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains the given element.
ja: 指定された要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the given predicate to compare elements.
ja: シーケンスが別のシーケンスの前に来るかどうかをある語彙筆記的順序（字典）順序において、与えられた述部を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the less-than operator (<) to compare elements.
ja: そのシーケンスが別のシーケンスの前に来るかどうかを、ある語彙筆記的順序（字典）順序において、より小さい演算子（<）を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the specified code unit is a UTF-8 continuation byte.
ja: 指定されたコード単位がUTF-8継続バイトかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the specified code unit is a high or low surrogate code unit.
ja: 指定されたコード単位が高位または低位サロゲートコード単位かを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether the specified code unit is a high-surrogate code unit.
ja: 指定されたコード単位が上位サロゲートコード単位かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the specified code unit is a low-surrogate code unit.
ja: 指定されたコード単位が下位サロゲートコード単位かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the string begins with the specified prefix.
ja: 文字列が指定された接頭辞で始まるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the string ends with the specified suffix.
ja: 文字列が指定された接尾辞で終わるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are equal.
ja: ２つの与えられた値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are not equal.
ja: ２つの与えられた値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain equivalent elements in the same order, using the given predicate as the equivalence test.
ja: このシーケンスともう一方のシーケンスが同等の要素を同じ順序で含むかどうかを、与えられた述部を同等テストとして使って、指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain the same elements in the same order.
ja: このシーケンスともう一方のシーケンスが同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two references point to different object instances.
ja: ２つの参照が異なるオブジェクトインスタンスを指しているかどうかを示すブール値を返します。

source: Returns a Boolean value indicating whether two references point to the same object instance.
ja: ２つの参照が同じオブジェクトインスタンスを指しているかどうかを示すブール値を返します。

source: Returns a Boolean value indicating whether two types are identical.
ja: ２つの型が同一かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two types are not identical.
ja: ２つの型が同一でないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are equal.
ja: ２つの値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two vectors are equal.
ja: ２つのベクターが等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether all elements produced by the asynchronous sequence satisfies the given predicate.
ja: あるブール値を返します、それは非同期シーケンスによって生み出される全ての要素がこの与えられた述部を満足させるかどうかを指し示します。

source: Returns a Boolean value that indicates whether the asynchronous sequence contains an element that satisfies the given predicate.
ja: あるブール値を返します、それは非同期シーケンスがこの与えられた述部を満足させる要素を含むかどうかを指し示します。

source: Returns a Boolean value that indicates whether the asynchronous sequence contains the given element.
ja: あるブール値を返します、それは非同期シーケンスがこの与えられた要素を含むかどうかを指し示します。

source: Returns a closed range that contains both of its bounds.
ja: それの境界の両方を含む完結範囲を返します。

source: Returns a copy of this vector, with elements other in the lanes where mask is true.
ja: このベクターのコピーを返します、maskがtrueであるところの、レーンの中の要素otherを持ちます。

source: Returns a copy of this vector, with elements replaced by elements of other in the lanes where mask is true.
ja: このベクターのコピーを返します、maskがtrueであるところの、レーンの中の要素otherを持ちます。

source: Returns a half-open range that contains its lower bound but not its upper bound.
ja: それの下側の境界は含むがそれの上側の境界はそうしない半開範囲を返します。

source: Returns a human-readable string giving the name of a given encoding.
ja: 与えられた符号化の名前を与えている、人間が読む文字列を返します。

source: Returns a lazy sequence that concatenates the elements of this sequence of sequences.
ja: このシーケンスに属する複数のシーケンスの要素を鎖状に連結する遅延シーケンスを返します。

source: Returns a lowercase version of the string.
ja: 文字列の小文字バージョンを返します。

source: Returns a mirror that reflects the UTF-16 view of a string.
ja: ある文字列のUTF-16ビューを反映するミラーを返します。

source: Returns a mirror that reflects the UTF-8 view of a string.
ja: ある文字列のUTF-8ビューを反映するミラーを返します。

source: Returns a mirror that reflects the Unicode scalars view of a string.
ja: ある文字列のユニコードスカラービューを反映するミラーを返します。

source: Returns a new collection of the same type containing, in order, the elements of the original collection that satisfy the given predicate.
ja: オリジナルのコレクションの要素で与えられた述部を満たすものを、順序正しく、含んでいる同じ型の新しいコレクションを返します。

source: Returns a new instance of the given type, constructed from the raw memory at the specified offset.
ja: 与えられた型の新しいインスタンスを返します、生のメモリから指定されたオフセットで構築されます。

source: Returns a new instance of the given type, read from the buffer pointer’s raw memory at the specified byte offset.
ja: 与えられた型の新しいインスタンスを返します、バッファポインタの生のメモリから指定されたバイトオフセットで読み込みます。

source: Returns a new string by concatenating the elements of the sequence, adding the given separator between each element.
ja: 各要素の間に与えられた分離子を加えて、シーケンスの要素を連結することによる新しい文字列を返します。

source: Returns a partial range extending upward from a lower bound.
ja: 下側の境界から上方に拡張している部分的な範囲を返します。

source: Returns a partial range up to, and including, its upper bound.
ja: それの上側の境界までの、そしてそれを含む部分的な範囲を返します。

source: Returns a partial range up to, but not including, its upper bound.
ja: それの上側の境界までの、しかしそれを含んでいない、部分的な範囲を返します。

source: Returns a pointer offset from this pointer by the specified number of instances.
ja: このポインタから指定された数のインスタンスだけオフセットしたポインタを返します。

source: Returns a pointer to the next consecutive instance.
ja: 次の隣接インスタンスへのポインタを返します。

source: Returns a pointer to the previous consecutive instance.
ja: 前の隣接インスタンスへのポインタを返します。

source: Returns a random element of the collection, using the given generator as a source for randomness.
ja: コレクションのある無作為な要素を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random element of the collection.
ja: コレクションのある無作為の要素を返します。

source: Returns a random value that is less than the given upper bound.
ja: 与えられた上側の境界より小さい無作為の値を返します。

source: Returns a random value within the specified range, using the given generator as a source for randomness.
ja: 指定された範囲内のある無作為な値を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random value within the specified range.
ja: 指定された範囲内のある無作為の値を返します。

source: Returns a sequence by skipping the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を飛ばすことによるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of final elements.
ja: 与えられた数の末尾要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を含んでいるあるシーケンスを返します。

source: Returns a sequence formed from first and repeated lazy applications of next.
ja: firstからそして繰り返しnextを遅延適用して形成されたシーケンスを返します。

source: Returns a sequence formed from repeated lazy applications of next to a mutable state.
ja: 繰り返しnextを可変のstateに遅延適用することから形成されたシーケンスを返します。

source: Returns a sequence from a starting value to, but not including, an end value, stepping by the specified amount.
ja: 指定の量だけ歩を進めて、始まりの値から終わりの値まで、しかしそれは含めないシーケンスを返します。

source: Returns a sequence from a starting value toward, and possibly including, an end value, stepping by the specified amount.
ja: 指定の量だけ歩を進めて、始まりの値から終わりの値の方へ、そしてもしかするとそれを含めるシーケンスを返します。

source: Returns a sequence of pairs (n, x), where n represents a consecutive integer starting at zero and x represents an element of the sequence.
ja: ペア (n, x) のシーケンスを返します、そこでnはゼロで開始する連続した数を表して、xはシーケンスの要素を表します。

source: Returns a sequence, up to the specified maximum length, containing the initial elements of the sequence.
ja: 指定された最大長まで、そのシーケンスの冒頭の要素を含んでいる、あるシーケンスを返します。

source: Returns a string created by using a given format string as a template into which the remaining argument values are substituted according to the user’s default locale.
ja: 与えられた書式設定文字列をテンプレートとして使ってユーザの省略時のロケールに従って残りの引数値がそれに対する代用とされることによって作成される文字列を返します。

source: Returns a string read from standard input through the end of the current line or until EOF is reached.
ja: 標準入力から現在の行の終わりまでまたはEOFが到達されるまで読み込んだ文字列を返します。

source: Returns a string representation of the Unicode scalar.
ja: ユニコードスカラーの文字列表現を返します。

source: Returns a subsequence by skipping elements while predicate returns true and returning the remaining elements.
ja: predicateがtrueを返す間は要素を飛ばして残りの要素を返すことによって、ある下位シーケンスを返します。

source: Returns a subsequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the specified number of final elements.
ja: 指定された数の末尾要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing the initial elements until predicate returns false and skipping the remaining elements.
ja: predicateがfalseを返すまで冒頭の要素を含んでいて残りの要素を飛ばしている、ある下位シーケンスを返します。

source: Returns a subsequence from the specified position to the end of the collection.
ja: 指定された位置からコレクションの終わりまでの下位シーケンスを返します。

source: Returns a subsequence from the start of the collection through the specified position.
ja: コレクションの始まりから指定された位置までも含む下位シーケンスを返します。

source: Returns a subsequence from the start of the collection up to, but not including, the specified position.
ja: コレクションの始まりから指定された位置まで、しかしそれは含めない下位シーケンスを返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの末尾の要素を含めて返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the sequence.
ja: 下位シーケンスを、指定された最大長まで、シーケンスの末尾の要素を含めて返します。

source: Returns a subsequence, up to the specified maximum length, containing the initial elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの冒頭の要素を含めて返します。

source: Returns a tuple containing the high and low parts of the result of multiplying this value by the given value.
ja: この値を指定の値で掛ける結果の高および低部分を含んでいるタプルを返します。

source: Returns a tuple containing the quotient and remainder of dividing the given value by this value.
ja: 与えられた値をこの値で除算した商と余りを含んでいるタプルを返します。

source: Returns a typed pointer to the memory referenced by this pointer, assuming that the memory is already bound to the specified type.
ja: このポインタによって参照されるメモリに対する型付ポインタを返します、メモリがすでに指定された型へ束縛されると仮定します。

source: Returns a value from a uniform, independent distribution of binary data.
ja: バイナリデータの一様な、独立分布からの値を返します。

source: Returns a value that is offset the specified distance from this value.
ja: 指定の隔たりをこの値からオフセットされたある値を返します。

source: Returns a vector mask with true or false randomly assigned in each lane, using the given generator as a source for randomness.
ja: 各レーンに無作為に割り当てられるtrueまたはfalseを持つあるベクターを返します、与えられた生成子を無作為さの出典として使います。

source: Returns a vector mask with true or false randomly assigned in each lane.
ja: 各レーンに無作為に割り当てられるtrueまたはfalseを持つあるベクターを返します。

source: Returns a vector mask with the result of a pointwise equality comparison.
ja: ポイント単位同等比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise inequality comparison.
ja: ポイント単位不等比較の結果を持つベクターマスクを返します。

source: Returns a view presenting the elements of the collection in reverse order.
ja: コレクションの要素を逆順に表しているある見方を返します。

source: Returns an Array of the encodings string objects support in the application’s environment.
ja: アプリケーションの環境においてサポートされる符号化文字列オブジェクトの配列を返します。

source: Returns an array containing the concatenated results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果を連結したものを含んでいる配列を返します。

source: Returns an array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列を返します。

source: Returns an array containing the non-nil results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果で非-nilのものを含んでいる配列を返します。

source: Returns an array containing the results of mapping the given closure over the sequence’s elements.
ja: 与えられたクロージャをシーケンスのもつ要素全体にわたってマップする結果を含んでいる配列を返します。

source: Returns an array containing, in order, the elements of the sequence that satisfy the given predicate.
ja: 指定された述部を満足させるものであるシーケンスの要素を、順序通りに、含んでいる配列を返します。

source: Returns an asynchronous sequence, containing the initial, consecutive elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンスを返します、基底シーケンスの冒頭の、連続する要素いくつかを含んでいます、それらは与えられた述部を満たすものです。

source: Returns an asynchronous sequence, up to the specified maximum length, containing the initial elements of the base asynchronous sequence.
ja: 指定された最大長まで、その基底非同期シーケンスの冒頭の要素を含んでいる、ある非同期シーケンスを返します。

source: Returns an index that is the specified distance from the given index, unless that distance is beyond a given limiting index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します、その隔たりが与えられた限界インデックスを越えない限りは。

source: Returns an index that is the specified distance from the given index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します。

source: Returns an initialized String object that contains a given number of characters from a given array of UTF-16 Code Units
ja: 初期化されたStringオブジェクトを返します、それは与えられた数の文字をユニコード文字からなる与えられた配列から含んでいます。

source: Returns an initialized String object that contains a given number of characters from a given array of Unicode characters.
ja: 初期化されたStringオブジェクトを返します、それは与えられた数の文字をユニコードスカラーからなる与えられた配列から含んでいます。

source: Returns an iterator over the bytes of this sequence.
ja: このシーケンスのバイトすべてを対象としたあるイテレータを返します。

source: Returns an iterator over the elements of the collection.
ja: コレクションの要素すべてを対象としたイテレータを返します。

source: Returns an iterator over the elements of this buffer.
ja: このバッファの要素すべてを対象としたイテレータを返します。

source: Returns an iterator over the elements of this sequence.
ja: このシーケンスの要素すべてを対象としたあるイテレータを返します。

source: Returns an uppercase version of the string.
ja: 文字列の大文字バージョンを返します。

source: Returns the current task’s priority.
ja: currentタスクのもつ優先度を返します。

source: Returns the C-string encoding assumed for any method accepting a C string as an argument.
ja: C文字列を引数として受け入れる何らかのメソッドのために仮定されるC文字列符号化を返します。

source: Returns the absolute value of the given number.
ja: 与えられた数の絶対値を返します。

source: Returns the bits of the given instance, interpreted as having the specified type.
ja: 与えられたインスタンスのビットを返します、指定された型を持つと解釈されます。

source: Returns the concatenated elements of this sequence of sequences, inserting the given separator between each element.
ja: 各要素の間に与えられた分離子を挿入して、このシーケンスに属する複数のシーケンスの要素を鎖状に連結して返します。

source: Returns the concatenated results of mapping the given transformation over this sequence.
ja: 与えられた変換をこのシーケンス全体にわたってマッピングする結果を鎖状に連結して返します。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection, using the given predicate as an equivalence test.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します、与えられた述部を同等性テストとして使います。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します。

source: Returns the difference obtained by subtracting the given value from this value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: 与えられた値をこの値から減じることで入手される差、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the difference of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の差を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the distance between two indices.
ja: ２つのインデックス間の隔たりを返します。

source: Returns the distance from this pointer to the given pointer, counted as instances of the pointer’s Pointee type.
ja: このポインタから与えられたポインタまでの隔たりを返します、ポインタのもつPointee型のインスタンスとして数えられます。

source: Returns the distance from this value to the given value, expressed as a stride.
ja: この値から特定の値までの隔たりを返します、ストライドとして表されます。

source: Returns the dynamic type of a value.
ja: ある値の動的型を返します。

source: Returns the elements of the sequence, shuffled using the given generator as a source for randomness.
ja: シーケンスの要素を返します、与えられた生成子を無作為さの出典として使って混ぜ合わされます。

source: Returns the elements of the sequence, shuffled.
ja: 入れ替えた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted using the given predicate as the comparison between elements.
ja: 与えられた述部を要素間の比較として使ってソートされた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted.
ja: シーケンスに属する要素を、ソートして返します。

source: Returns the elements of this sequence of sequences, concatenated.
ja: このシーケンスに属する複数のシーケンスの要素を、鎖状に連結して返します。

source: Returns the first element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最初の要素を返します。

source: Returns the first index in which an element of the collection satisfies the given predicate.
ja: 最初のインデックスで、それにおけるコレクションの要素が与えられた述部を満足させるものを返します。

source: Returns the first index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最初のインデックスを返します。

source: Returns the given instance cast unconditionally to the specified type.
ja: 与えられたインスタンスを無条件に特定の型にキャストして返します。

source: Returns the given integer as the equivalent value in a different integer type.
ja: 与えられた整数を同等値としてある異なる整数型において返します。

source: Returns the given number unchanged.
ja: 与えられた数を変更せずに返します。

source: Returns the greater of two comparable values.
ja: ２つの比較可能な値のうちより大きいものを返します。

source: Returns the greatest argument passed.
ja: 渡された引数の最も大きいものを返します。

source: Returns the high-surrogate code unit of the surrogate pair representing the specified Unicode scalar.
ja: 指定されたユニコードスカラーを表しているサロゲートペアの上位サロゲートコード単位を返します。

source: Returns the index of the last element in the collection that matches the given predicate.
ja: 与えられた述部に合致する、コレクションの中の最後の要素のインデックスを返します。

source: Returns the inverse of the bits set in the argument.
ja: 引数におけるビットの逆順を返します。

source: Returns the last element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たす、シーケンスの最後の要素を返します。

source: Returns the last index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最後のインデックスを返します。

source: Returns the least argument passed.
ja: 渡された引数の最も少ないものを返します。

source: Returns the lesser of two comparable values.
ja: ２つの比較可能な値のうちより小さいものを返します。

source: Returns the longest possible subsequences of the collection, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このコレクションの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the collection, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このコレクションの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the longest possible subsequences of the sequence, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このシーケンスの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the sequence, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このシーケンスの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the low-surrogate code unit of the surrogate pair representing the specified Unicode scalar.
ja: 指定されたユニコードスカラーを表しているサロゲートペアの下位サロゲートコード単位を返します。
